In [231]:
import numpy as np  
import pandas as pd 

#LOAD DATA CSV FILE
df_order=pd.read_csv('datasets/client_zoocsv.csv', header=0)
df_order

,id,first_name,last_name,location,cat,dog,other,order,company_order,frequency
0,1,Ellissa,Snoddy,Czech Republic,False,False,True,"€990,68",Colgate-Palmolive Company,year
1,2,Noak,De Ambrosi,Poland,NaN,NaN,NaN,NaN,NaN,quarter
2,3,Marlo,Derham,Poland,True,True,True,"€32,01",TOP CARE (Topco Associates LLC),week
3,4,Carroll,Clarke-Williams,Czech Republic,False,True,True,"€243,15",Teva Pharmaceuticals USA Inc,week
4,5,Joy,Camden,Poland,False,True,True,"€149,16",Eli Lilly and Company,week
...,...,...,...,...,...,...,...,...,...,...
495,496,Hildegarde,Boldero,NaN,True,False,False,"€926,62",Meijer Distribution Inc,month
496,497,Anna-diane,Easton,Poland,False,True,False,"€912,65",Sandoz Inc,quarter
497,498,Kathie,Rushmare,Poland,True,True,True,"€164,67",Ventura Corporation LTD.,week
498,499,Maia,Dudeney,Poland,False,True,True,"€870,31",Rebel Distributors Corp,month
499,500,Rafaelia,Antonikov,Czech Republic,NaN,NaN,NaN,NaN,NaN,month

In [232]:
#PREPARING DATA
#cleaning data >  drop NaN "missing data"
#types > int /float ORDER COLUMN 

newdf=df_order.dropna()    #cleanin
newdf

,id,first_name,last_name,location,cat,dog,other,order,company_order,frequency
0,1,Ellissa,Snoddy,Czech Republic,False,False,True,"€990,68",Colgate-Palmolive Company,year
2,3,Marlo,Derham,Poland,True,True,True,"€32,01",TOP CARE (Topco Associates LLC),week
3,4,Carroll,Clarke-Williams,Czech Republic,False,True,True,"€243,15",Teva Pharmaceuticals USA Inc,week
4,5,Joy,Camden,Poland,False,True,True,"€149,16",Eli Lilly and Company,week
9,10,Isahella,Bingall,Czech Republic,False,True,False,"€295,29",Dolgencorp Inc,month
...,...,...,...,...,...,...,...,...,...,...
492,493,Gal,Sparke,Poland,True,False,True,"€428,30","Go Smile, Inc.",week
494,495,Ethelin,Salman,Poland,False,False,True,"€472,26",Valu Merchandisers Company,year
496,497,Anna-diane,Easton,Poland,False,True,False,"€912,65",Sandoz Inc,quarter
497,498,Kathie,Rushmare,Poland,True,True,True,"€164,67",Ventura Corporation LTD.,week
498,499,Maia,Dudeney,Poland,False,True,True,"€870,31",Rebel Distributors Corp,month

In [233]:
newdf.order.convert_dtypes() #string

0      €990,68
2       €32,01
3      €243,15
4      €149,16
9      €295,29
        ...
492    €428,30
494    €472,26
496    €912,65
497    €164,67
498    €870,31
Name: order, Length: 305, dtype: string

In [234]:
#cleaning symbol currency > float dtype

new=[]
for x in newdf.order:
    x=x[1:]
    new.append(x)

newdf.order=new
newdf.order

0      990,68
2       32,01
3      243,15
4      149,16
9      295,29
        ...
492    428,30
494    472,26
496    912,65
497    164,67
498    870,31
Name: order, Length: 305, dtype: object

In [240]:
#change type object/str >> float column 
newdf.order=newdf.order.str.replace(',','.')

In [247]:
newdf.order=pd.to_numeric(newdf.order)  #float

In [248]:
newdf.order

0      990.68
2       32.01
3      243.15
4      149.16
9      295.29
        ...
492    428.30
494    472.26
496    912.65
497    164.67
498    870.31
Name: order, Length: 305, dtype: float64

In [261]:
#PREPARING DATA/cleaning data 
#>>removing outliners  Standrad deviation IQR METODY

#Standrad Deviation - ex.g "Sum of order"

meanorder=newdf.order.mean()
stdorder=newdf.order.std()

toprange=meanorder+stdorder*1.96
downrange=meanorder-stdorder*1.96

copydf=newdf

copydf=copydf.drop(copydf[copydf.order> toprange].index)
copydf=copydf.drop(copydf[copydf.order< downrange].index)

copydf

,id,first_name,last_name,location,cat,dog,other,order,company_order,frequency
0,1,Ellissa,Snoddy,Czech Republic,False,False,True,990.68,Colgate-Palmolive Company,year
2,3,Marlo,Derham,Poland,True,True,True,32.01,TOP CARE (Topco Associates LLC),week
3,4,Carroll,Clarke-Williams,Czech Republic,False,True,True,243.15,Teva Pharmaceuticals USA Inc,week
4,5,Joy,Camden,Poland,False,True,True,149.16,Eli Lilly and Company,week
9,10,Isahella,Bingall,Czech Republic,False,True,False,295.29,Dolgencorp Inc,month
...,...,...,...,...,...,...,...,...,...,...
492,493,Gal,Sparke,Poland,True,False,True,428.30,"Go Smile, Inc.",week
494,495,Ethelin,Salman,Poland,False,False,True,472.26,Valu Merchandisers Company,year
496,497,Anna-diane,Easton,Poland,False,True,False,912.65,Sandoz Inc,quarter
497,498,Kathie,Rushmare,Poland,True,True,True,164.67,Ventura Corporation LTD.,week
498,499,Maia,Dudeney,Poland,False,True,True,870.31,Rebel Distributors Corp,month